
The scimax playlist: https://www.youtube.com/playlist?list=PL0sMmOaE_gs3E0OjExoI7vlCAVygj6S4I

* iteration

https://www.youtube.com/watch?v=yUnEjAPxW5A&t=19s

* functions https://www.youtube.com/watch?v=t-IsXzEz7hs&list=PL0sMmOaE_gs3E0OjExoI7vlCAVygj6S4I&index=3&t=49s

* Formatting strings https://www.youtube.com/watch?v=kk2W9krvNVg&list=PL0sMmOaE_gs3E0OjExoI7vlCAVygj6S4I&index=1

* TODO data structures

string
list 
vector 
a-list
p-list
hash table


arrays

* TODO seq

#+BEGIN_SRC emacs-lisp
(seq-map-indexed (lambda (val i) (cons i val)) '(a b c))
#+END_SRC

#+RESULTS:
: ((0 . a) (1 . b) (2 . c))


#+BEGIN_SRC emacs-lisp
(seq-reverse "abra")
#+END_SRC

#+RESULTS:
: arba

#+BEGIN_SRC emacs-lisp
(let ((a [1 2 3]))
  (aset a 0 21 )
  (aref a 0))
#+END_SRC

#+RESULTS:
: 21
